<?php
    $con = mysqli_connect("localhost", "root", "1234","pacerfitdb");
    mysqli_query($con,'SET NAMES utf8');
    $response = array();

    $userID = mysqli_real_escape_string($con, $_POST["userID"]);
    $userPassword = mysqli_real_escape_string($con, $_POST["userPassword"]);
    $userName = mysqli_real_escape_string($con, $_POST["userName"]);
    $userGender = mysqli_real_escape_string($con, $_POST["userGender"]);
    $userAge = mysqli_real_escape_string($con, $_POST["userAge"]);
    $userHeight = mysqli_real_escape_string($con, $_POST["userHeight"]);
    $userWeight = mysqli_real_escape_string($con, $_POST["userWeight"]);
    $userProfileNum = 0;
    $level_like=0;
    $tag_park=0;$tag_mountain=0;$tag_forest=0;$tag_sea=0;$tag_beach=0;$tag_trekking=0;$tag_nature=0;$tag_sights=0;$tag_town=0;$tag_scenery=0;$tag_history=0;
    //return을 써서 종료하게 해야함. (echo $response["success"]=false 를 줘야하고, 이유까지 주기.)
    $sql = "SELECT userID,userName FROM member";
    $result = mysqli_query($con,$sql);
    while($row = mysqli_fetch_array($result)){
        if($row['userID']==$userID){
            $response["success"]=false;
            $response["answer"]="id";
            echo json_encode($response);
            return;
        }
        if($row['userName']==$userName){
            $response["success"]=false;
            $response["answer"]="name";
            echo json_encode($response);
            return;
        }
    }
    $statement = mysqli_prepare($con, "INSERT INTO member VALUES (?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?)");
    mysqli_stmt_bind_param($statement, "ssssiddiiiiiiiiiiiii", $userID, $userPassword, $userName, $userGender, $userAge, $userHeight, $userWeight, $userProfileNum
    ,$level_like,$tag_park,$tag_mountain,$tag_forest,$tag_sea,$tag_beach,$tag_trekking,$tag_nature,$tag_sights,$tag_town,$tag_scenery,$tag_history);
    mysqli_stmt_execute($statement);
    $response["success"] = true;

    $sql = "INSERT INTO bestRecord VALUES ('$userID',0,0,0,0,0,0)";
    mysqli_query($con, $sql);

   $sql = "INSERT INTO seongbukgu_rate (userID) VALUES ('$userID')";
   mysqli_query($con,$sql);

    //레코드 365개 만보기레코드 생성
    $sql = "INSERT INTO stepsRecord VALUES ('$userID',0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)";
    mysqli_query($con, $sql);

    //레코드 365개 만보기 칼로리소모량 레코드 생성
    $sql = "INSERT INTO stepsCalorieRecord VALUES ('$userID',0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)";
    mysqli_query($con, $sql);

    //레코드 365개 만보기 운동시간 레코드 생성
    $sql = "INSERT INTO stepsTimeRecord VALUES ('$userID',0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)";
    mysqli_query($con, $sql);

    //레코드 365개 Km레코드 생성
    $sql = "INSERT INTO kmRecord VALUES ('$userID',0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)";
    mysqli_query($con, $sql);

    //레코드 365개 Km 칼로리소모량 레코드 생성
    $sql = "INSERT INTO kmCalorieRecord VALUES ('$userID',0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)";
    mysqli_query($con, $sql);

    //레코드 365개 Km 운동시간 레코드 생성
    $sql = "INSERT INTO kmTimeRecord VALUES ('$userID',0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    ,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0)";
    mysqli_query($con, $sql);


    // $arrayList = array('0'); // 배열 데이터을 반복문읠 이용하여 INSERT 문장을 만든다.
    // for ( $i = 0; $i < 366; $i++) {
    //     // 일련번호를 생성한다.
    //     $seq = $i+1;
    //     if(seq==1){
    //         $sub_sql_array[] = " ( '{$seq}', '{$userID}' ) ";
    //         continue;
    //     }
    //     // Bulk Insert를 위한 서브 SQL을 만든다.
    //     $sub_sql_array[] = " ( '{$seq}', '{$arrayList[0]}' ) ";
    // }
    // // Bulk Insert 방식으로 일괄로 데이터를 저장한다.
    // $sql = " INSERT INTO stepsRecord ( seq, col ) VALUES ";
    // $sub_sql = implode(', ', $sub_sql_array);
    // $sql .= $sub_sql;
    // mysqli_query($con, $sql);
    // // result
    // // INSERT INTO table ( seq, col ) VALUES ( '1', '0' ) , ( '2', '0' ) , ( '3', '0' )

    //bulk insert#1
    // $sql = array();
    // foreach( $data as $row ) {
    //     $sql[] = '("'.mysql_real_escape_string($row['text']).'", '.$row['category_id'].')';
    // }
    // mysql_query('INSERT INTO table (text, category) VALUES '.implode(',', $sql));

    // //bulk insert#2
    // $sql = array();
    // foreach($data as $row) {
    //     $sql[] = '('.$row['id'].', "'.mysql_real_escape_string($row['name']).'")';
    // }
    // mysql_query('INSERT INTO stepsRecord (id, name) VALUES '.implode(',', $sql));

    // $statement = mysqli_prepare($con, "INSERT INTO bestRecord VALUES (?,?,?,?,?,?,?)");
    // mysqli_stmt_bind_param($statement, "sididid", $userID,0,0,0,0,0,0);
    // mysqli_stmt_execute($statement);

    echo json_encode($response);

?>
